package days02;

public class Ex05_09 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		// [실수 표현]
		// 1) 실수 3.14 -> 2진수 표현 -> float [][][][][][][][] * 4
		// [예]
		/*
		 *    -> 2진수 표현(2진법 변환)
		 * 0.625    --> 0.101(2진법) 
		 * 0.625 x 2 = [1].25 ^
		 * 0.25 x 2  = [0].5  |
		 * 0.5 x 2   = [1].0  |
		 * 
		 * 0.101(2) -> 10진수 실수 전환
		 *   0.  1      0      1(2)
		 * 		2^-1 + 2^-2 + 2^-3 = 0.5 + 0 + 0.125
		 * 
		 * [예]float/double 오차가 생긴다.
		 * 0.123456 유한실수
		 * 0.000111111111100110101010101111111...
		 * 
		 * 
		 * 
		 * */
		
	}// main

}// class
